In [1]:
import pandas as pd

In [2]:
stocks = pd.read_csv('http://bit.ly/smallstocks')

In [4]:
# Symbol -> Company symbols Cisco, Apple, Microsoft
# Date -> 3 days stock for the 3 companys
# Close -> Closing price of stocks that day
# Volume
stocks

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [5]:
#Here, range index from 0 to 8. It's a regular index
stocks.index

RangeIndex(start=0, stop=9, step=1)

In [6]:
# Group by Company and then average/mean closing price of 3 days for each of the companies
stocks.groupby('Symbol').Close.mean()

Symbol
AAPL    112.856667
CSCO     31.480000
MSFT     57.433333
Name: Close, dtype: float64

In [11]:
'''
Group by the Closing price mean by Symbol and date. 
A bit silly beacuse there is only 1 closing price for each date and company. 
But for our purpose we're doing it anyway.
'''
#Save the series to 'ser'
ser = stocks.groupby(['Symbol', 'Date']).Close.mean()
ser

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [13]:
ser.index
#As we can see, it's a multiindex series
#A series is one dimensional. But a series with multi-index, is 2 dimensional
#Similarly, a DataFrame is normally 2 dimensional. But with multi-index, it's at least 3 dimensional.

MultiIndex([('AAPL', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('AAPL', '2016-10-05'),
            ('CSCO', '2016-10-03'),
            ('CSCO', '2016-10-04'),
            ('CSCO', '2016-10-05'),
            ('MSFT', '2016-10-03'),
            ('MSFT', '2016-10-04'),
            ('MSFT', '2016-10-05')],
           names=['Symbol', 'Date'])

In [14]:
#You can unstack a 2D series, and it will be converted to a DataFrame
ser.unstack()

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [15]:
# You can convert your DataFrame like the unstacked series, with just using Pivot Table
# Default aggregate function of pivot table is mean(). But you can change that
df = stocks.pivot_table(values='Close', index='Symbol', columns='Date')

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [16]:
ser

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [19]:
#Let's first see selection on multi-index series. It will help us in selection of multi-index dataframe as well
ser.loc['AAPL']

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: Close, dtype: float64

In [20]:
ser.loc['AAPL','2016-10-03'] # or, ser.loc['AAPL']['2016-10-03']

112.52

In [23]:
ser.loc[:,'2016-10-03'] # Getting all data for a specific date. [Using inner level index]

Symbol
AAPL    112.52
CSCO     31.50
MSFT     57.42
Name: Close, dtype: float64

In [26]:
df = ser.unstack()
df

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [27]:
#Selection in DataFrame works in the absolute same way as series
df.loc['AAPL']

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: AAPL, dtype: float64

In [28]:
df.loc['AAPL','2016-10-03']

112.52

In [29]:
df.loc[:,'2016-10-03']

Symbol
AAPL    112.52
CSCO     31.50
MSFT     57.42
Name: 2016-10-03, dtype: float64

In [30]:
stocks

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [31]:
#Create multi-index out of stocks DataFrame
stocks.set_index(['Symbol', 'Date'], inplace=True)
stocks

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900
CSCO   2016-10-04   31.35  18460400
MSFT   2016-10-05   57.64  16726400
CSCO   2016-10-05   31.59  11808600
AAPL   2016-10-05  113.05  21453100

In [32]:
stocks.index

MultiIndex([('CSCO', '2016-10-03'),
            ('AAPL', '2016-10-03'),
            ('MSFT', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('MSFT', '2016-10-04'),
            ('CSCO', '2016-10-04'),
            ('MSFT', '2016-10-05'),
            ('CSCO', '2016-10-05'),
            ('AAPL', '2016-10-05')],
           names=['Symbol', 'Date'])

In [33]:
#still the dataframe does not look like multi-index. Let's fix it.
#by using sort_index, it first gets sorted by the outer index level, and then the inner index level
stocks.sort_index(inplace=True)

In [34]:
stocks

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

In [35]:
#Selection in multi-index
stocks.loc['AAPL']

             Close    Volume
Date
2016-10-03  112.52  21701800
2016-10-04  113.00  29736800
2016-10-05  113.05  21453100

In [46]:
#Selection of rows and columns seperated by comma. Pass row and column indexes as tuples
#What rows do you want. For that -> ('AAPL','2016-10-03')
#What columns do you want. For that -> ':' . As I want all columns 
stocks.loc[('AAPL','2016-10-03'),:]

Close          112.52
Volume    21701800.00
Name: (AAPL, 2016-10-03), dtype: float64

In [48]:
#Another Example
stocks.loc[('AAPL','2016-10-03'),('Close')]

112.52

In [45]:
#Another example
stocks.loc[:,('Volume')]

Symbol  Date
AAPL    2016-10-03    21701800
        2016-10-04    29736800
        2016-10-05    21453100
CSCO    2016-10-03    14070500
        2016-10-04    18460400
        2016-10-05    11808600
MSFT    2016-10-03    19189500
        2016-10-04    20085900
        2016-10-05    16726400
Name: Volume, dtype: int64

In [49]:
#Let's say we want stocks for apple and microsoft for a particular day.
#Similar to Cross-Section Selection
#Then,
stocks.loc[(['AAPL','MSFT'],'2016-10-03'),:]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500

In [50]:
#Another example
stocks.loc[(['AAPL','MSFT'],'2016-10-03'),'Close']

Symbol  Date
AAPL    2016-10-03    112.52
MSFT    2016-10-03     57.42
Name: Close, dtype: float64

In [51]:
#Another exmaple
stocks.loc[('AAPL',['2016-10-03','2016-10-04']),'Close']

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
Name: Close, dtype: float64

In [52]:
#Tricky: Let's say we want stocks for all companies but for these two dates only.
#First you'd thought about using a colon. But that doesn't work.
stocks.loc[(:,['2016-10-03','2016-10-04']),'Close']

SyntaxError: invalid syntax (<ipython-input-52-f16ec1194639>, line 2)

In [54]:
#For selecting all elements of an index you need to use slice(none)
stocks.loc[(slice(None),['2016-10-03','2016-10-04']),:]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900

In [55]:
# If you want to remove multi-index: stocks.reset_index()
stocks.reset_index()

  Symbol        Date   Close    Volume
0   AAPL  2016-10-03  112.52  21701800
1   AAPL  2016-10-04  113.00  29736800
2   AAPL  2016-10-05  113.05  21453100
3   CSCO  2016-10-03   31.50  14070500
4   CSCO  2016-10-04   31.35  18460400
5   CSCO  2016-10-05   31.59  11808600
6   MSFT  2016-10-03   57.42  19189500
7   MSFT  2016-10-04   57.24  20085900
8   MSFT  2016-10-05   57.64  16726400